Enterprise_Serivces/Prod/Bronze1/AllSparkChannel/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/allsparkservice/contracts/2010/11/IAllSparkService/PurchaseDigitalToken</wsa:Action><wsa:MessageID>uuid:fbc54c17-1596-4d18-9810-4af12dc6bd8e</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://allsparkchannelqa1.testgs.pvt/AllSparkService.svc</wsa:To></soap:Header><soap:Body><PurchaseDigitalToken xmlns="http://www.gamestop.com/services/channel/allsparkservice/contracts/2010/11"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CountryCode xmlns="http://www.gamestop.com/services/core/contracts/2010/08">US</CountryCode><International xmlns="http://www.gamestop.com/services/core/contracts/2010/08"><Locale xmlns="http://www.w3.org/2005/09/ws-i18n">en-US</Locale><TZ xmlns="http://www.w3.org/2005/09/ws-i18n">CST</TZ></International><PartnerKey xmlns="http://www.gamestop.com/services/csl/globaldigitalcontent/allspark/contracts/messages/2010/08">TEST-US</PartnerKey><AllSparkID xmlns="http://www.gamestop.com/services/csl/allsparkservice/contracts/messages/2010/08">20180</AllSparkID><CPItemGUID xmlns="http://www.gamestop.com/services/csl/allsparkservice/contracts/messages/2010/08">587d8dd4-b3f7-4677-b3ba-265bff0fc129</CPItemGUID><CPReference xmlns="http://www.gamestop.com/services/csl/allsparkservice/contracts/messages/2010/08">a0a82949-0746-4158-a1cf-a85dd6265274</CPReference></request></PurchaseDigitalToken></soap:Body></soap:Envelope>